{
    "sessions": [
        {
            "id": "smp-future-of-work-jan26",
            "title": "The Future of Work with AI: Strategic Implications",
            "institution": "IIM Kozhikode",
            "program": "SMP",
            "cohort": "Jan 2026",
            "url": "presentations/smp-future-work-jan26.html",
            "viewerUrl": "presentations/smp-future-work-jan26.html",
            "desc": "Strategic frameworks for navigating AI's impact on work—mechanics of agency, the job unbundling event, the EPOCH framework, and building resilient careers through the economic reality check.",
            "tags": ["AI", "Strategy"],
            "featured": true
        },
        {
            "id": "smp-research-analysis-jan26",
            "title": "AI for Research, Analysis, and Decision Support",
            "institution": "IIM Kozhikode",
            "program": "SMP",
            "cohort": "Jan 2026",
            "url": "presentations/smp-research-analysis-jan26.html",
            "viewerUrl": "presentations/smp-research-analysis-jan26.html",
            "desc": "Solving the 'No Real-Time Knowledge' problem with NotebookLM and Gemini Deep Research—turning organizational memory and market intelligence into strategic advantage through practical demos.",
            "tags": ["AI", "NotebookLM", "Research"],
            "featured": true
        },
        {
            "id": "smp-ai-foundations-jan26",
            "title": "Foundations of Generative AI",
            "institution": "IIM Kozhikode",
            "program": "SMP",
            "cohort": "Jan 2026",
            "url": "presentations/smp-ai-foundations-jan26.html",
            "viewerUrl": "presentations/smp-ai-foundations-jan26.html",
            "desc": "Mental models for understanding generative AI—the brilliant intern metaphor, how LLMs work, prompting fundamentals, and interactive techniques.",
            "tags": ["AI"],
            "featured": true
        },
        {
    "id": "ai-phd-research",
    "title": "AI for PhD Research",
    "institution": "IIM Kozhikode",
    "program": "DPM",
    "cohort": "Dec 2025",
    "url": "presentations/ai-phd-research.html",
  "viewerUrl": "presentations/ai-phd-research.html",
            "handout": "presentations/ai-phd-handout.html",
    "desc": "A comprehensive guide on leveraging AI tools and strategies for the doctoral research lifecycle.",
    "tags": ["AI", "NotebookLM", "Research"],
    "featured": true
        },
        {
            "id": "cx-genai-nov25",
            "title": "Customer Experience in the Age of GenAI",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Nov 2025",
            "url": "https://docs.google.com/presentation/d/1cyDBSgdKCJ0rXiTFLE2FUqaoVdsrXTeMai0p7lLm7DM/edit?slide=id.p#slide=id.p",
            "desc": "How generative AI is reshaping customer journeys and what leaders need to do now.",
            "tags": ["Customer Experience", "AI"],
            "featured": false
        },
        {
            "id": "ai-marketing-nov25",
            "title": "AI for Marketing Use-Cases",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Nov 2025",
            "url": "https://docs.google.com/presentation/d/1KRKw6VChsOvk9-al_edN37HTAcytfbnq1qPCh6u7sYk/edit?usp=sharing",
            "desc": "Practical AI applications across the marketing funnel with real implementation examples.",
            "tags": ["Marketing", "AI"],
            "featured": true
        },
        {
            "id": "agile-nov25",
            "title": "Agile Methodology: Experiences and Perspectives",
            "institution": "IIM Kozhikode",
            "program": "EPGP",
            "cohort": "Nov 2025",
            "url": "https://docs.google.com/presentation/d/1s_7Nr8y5_eMfU09mFETCl0Gz3JYNwvsJM6Y96QR9nHE/edit?slide=id.p#slide=id.p",
            "desc": "Battle-tested agile practices from building products at Google, Amazon, and startups.",
            "tags": ["Product Management"],
            "featured": false
        },
        {
            "id": "pm-practice-nov25",
            "title": "Product Management in Practice",
            "institution": "IIM Kozhikode",
            "program": "EPGP",
            "cohort": "Nov 2025",
            "url": "https://docs.google.com/presentation/d/1xUyR4h9Jmou8z4G1SnxjPP8HYXvt1ixwBxYBVlfKaQo/",
            "desc": "The unglamorous reality of shipping products—frameworks that actually work.",
            "tags": ["Product Management"],
            "featured": false
        },
        {
            "id": "experimentation-nov25",
            "title": "Experimentation in Product Management",
            "institution": "IIM Kozhikode",
            "program": "EPGP",
            "cohort": "Nov 2025",
            "url": "https://docs.google.com/presentation/d/1mmB-nvrVx48brKXIPWwOxUp50crWGy9iYYE9ieOyKNI/edit?slide=id.g3677a303623_0_321#slide=id.g3677a303623_0_321",
            "desc": "Designing experiments that yield actionable insights, not vanity metrics.",
            "tags": ["Product Management"],
            "featured": true
        },
        {
            "id": "ai-sales-workshop-nov25",
            "title": "AI for Indian Sales Leaders: Workshop",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Nov 2025",
            "url": "presentations/ai-sales-workshop-presentation_5.html",
            "viewerUrl": "presentations/ai-sales-workshop-presentation_5.html",
            "desc": "Hands-on workshop building AI tools for Indian B2B sales contexts.",
            "tags": ["Sales", "AI"],
            "featured": true
        },
        {
            "id": "ai-101-oct25",
            "title": "AI 101 for Business Leaders",
            "institution": "IIM Kozhikode",
            "program": "Open MDP",
            "cohort": "Oct 2025",
            "url": "https://docs.google.com/presentation/d/1VNxAYqf86tW6qP9JGn0G0ZtOkdREdjErSCSO4wQctvA/",
            "desc": "Demystifying AI for executives—what to invest in, what to ignore.",
            "tags": ["AI"],
            "featured": true
        },
        {
            "id": "customer-needs-nov21",
            "title": "Understanding Customer Needs",
            "institution": "IIM Kozhikode",
            "program": "EPGP",
            "cohort": "Nov 2021",
            "url": "https://docs.google.com/presentation/d/1jvBm7ih2nm7NtE5iFPB8D6FavgmYhRHDXTfR8C8BSvc/edit?slide=id.g10f685c2904_1_86#slide=id.g10f685c2904_1_86",
            "desc": "Deep customer discovery techniques from 18 years of building products people actually want.",
            "tags": ["Customer Experience", "Product Management"],
            "featured": false
        },
        {
            "id": "pricing-ecom-nov21",
            "title": "Pricing in E-Commerce",
            "institution": "IIM Kozhikode",
            "program": "EPGP",
            "cohort": "Nov 2021",
            "url": "https://docs.google.com/presentation/d/11CDsiyMkb95r_9A-vKK_sYHJbt0Tpg87SWGp6jEtKRA/edit?usp=sharing",
            "desc": "Dynamic pricing strategies and the psychology behind what people pay.",
            "tags": ["Product Management"],
            "featured": false
        },
        {
            "id": "crm-feb22",
            "title": "Customer Relationship Marketing",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Feb 2022",
            "url": "https://drive.google.com/file/d/1Y9UCxVlfl2KchvJse1FgdoGj1jMqiP84/view",
            "desc": "CAC vs LTV economics, the AARRR funnel, and data-driven pricing strategies for e-commerce.",
            "tags": ["Marketing", "Customer Experience"],
            "featured": false
        },
        {
            "id": "ecom-scm-mar22",
            "title": "Value Creation in E-Commerce Platform and Supply Chain Management",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Mar 2022",
            "url": "https://drive.google.com/file/d/1szLOo9T1kIwZBC6Gr6oB8aVPa0JHfGCL/view",
            "desc": "Forward and reverse logistics, last-mile delivery challenges, and building efficient e-commerce supply chains.",
            "tags": ["Product Management"],
            "featured": false
        },
        {
            "id": "jtbd-oct21",
            "title": "Jobs to be Done Framework",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Oct 2021",
            "url": "https://drive.google.com/file/d/1XQBt87t14A8T-rxM0Z9Pz8fTq5376OI1/view",
            "desc": "Problem space vs solution space thinking, with real examples of outcome-oriented product development.",
            "tags": ["Product Management"],
            "featured": true
        },
        {
            "id": "service-design-jan22",
            "title": "Service Design and Product Architecture",
            "institution": "IIM Kozhikode",
            "program": "MDP",
            "cohort": "Jan 2022",
            "url": "https://drive.google.com/file/d/1cOiS8QRkAIorXGBvPKslNJ2h2MW7d5EO/view",
            "desc": "Three levels of customer pain points, journey mapping, and the 15 principles of good service design.",
            "tags": ["Product Management", "Customer Experience"],
            "featured": false
        }
    ],
    "resources": [
      {
    "id": "autoregressive-playground",
    "title": "Auto-Regressive Playground",
    "type": "Interactive Tool",
    "desc": "Watch how LLMs think, one token at a time. An interactive visualization showing probability distributions, temperature effects, and hallucination detection in real-time. Built with React and powered by Gemini API.",
    "link": "https://ai.studio/apps/drive/1BDYTIlrTt8IIrAAxg46-BWhwAEfwUFge",
    "tags": ["AI", "Education"],
    "featured": true,
    "platforms": ["gemini"],
    "requires_api_key": true
    },
        {
            "id": "b2b-sales-intelligence",
            "title": "B2B Sales Intelligence Analyzer",
            "type": "Prompt",
            "desc": "Transform public company data into a comprehensive sales briefing—decision-makers, pain points, budget signals, and personalized engagement strategy.",
            "link": "#",
            "tags": ["Sales", "AI"],
            "featured": true,
            "platforms": ["universal"],
            "prompt_text": "Analyze [Company Name] using the framework below to prepare for B2B sales engagement.\nUse publicly available information: company website, annual reports, press releases, LinkedIn, news articles, and industry reports. Focus on actionable intelligence for sales conversations.\n\nOutput format (exact structure required):\n\nSales Intelligence Summary (150–200 words)\nSummarize what this company does, its current business priorities, potential pain points, and why they might need solutions in your domain. End with one sentence describing the ideal conversation opener.\n\n1. Business Overview and Decision-Making Structure\n• Core business activities and how they generate revenue.\n• Organizational structure: key business units, reporting lines, and geographic presence in India.\n• Identify likely decision-makers and influencers by function (procurement, IT, finance, operations).\n• Note any recent leadership changes or reorganizations.\n\n2. Current Business Priorities and Stated Initiatives\n• What strategic priorities has leadership publicly communicated (earnings calls, interviews, annual reports)?\n• Any announced digital transformation, cost optimization, expansion, or compliance initiatives.\n• Recent press releases or news indicating new projects, partnerships, or challenges.\n\n3. Pain Points and Trigger Events\n• Identify operational, regulatory, or competitive pressures the company is likely facing.\n• Recent trigger events: funding rounds, acquisitions, leadership changes, regulatory actions, or public setbacks.\n• Gaps or inefficiencies implied by their public statements or industry context.\n\n4. Competitive Position and Vendor Landscape\n• Who are their main competitors, and how is this company differentiated?\n• Any known existing vendors or technology partners (from case studies, press releases, job postings).\n• Are they likely locked into long-term contracts, or is there room for new vendors?\n\n5. Financial Health and Budget Signals\n• Revenue scale and recent growth trajectory.\n• Profitability indicators: are they in investment mode, cost-cutting mode, or stable?\n• Any signals about budget availability (capex plans, hiring trends, recent investments).\n\n6. India-Specific Context\n• Scale of India operations: headcount, office locations, manufacturing or service delivery presence.\n• India-specific regulatory or compliance requirements relevant to your solution.\n• Local leadership and their decision-making authority versus global headquarters.\n\n7. Relationship Entry Points\n• Identify mutual connections, alumni networks, or industry associations.\n• Events, conferences, or forums where this company participates.\n• Content or thought leadership topics their executives engage with publicly.\n\n8. Objection Anticipation\n• Likely objections based on company size, existing solutions, or budget constraints.\n• Organizational or cultural factors that might slow decision-making.\n• Procurement process complexity (tender requirements, vendor empanelment).\n\n9. Value Proposition Alignment\n• Map your solution's capabilities to their publicly stated priorities.\n• Quantifiable outcomes you can credibly promise based on similar customer profiles.\n• Reference customers or case studies that would resonate with this prospect.\n\n10. Recommended Engagement Approach\n• Suggested outreach sequence: who to contact first, through what channel.\n• Talking points tailored to their context.\n• Red flags or topics to avoid.\n\nTone: Practical, conversational, focused on action.\nGoal: Equip a sales professional to walk into a meeting well-prepared, with relevant context and a clear hypothesis about why this company should care."
    },
        {
            "id": "ideation-engine",
            "title": "Ideation Engine",
            "type": "Prompt",
            "desc": "A Socratic dialogue engine that evolves nascent ideas into resilient strategies by deconstructing axioms, mapping ecosystems, and applying evolutionary pressure.",
            "link": "#",
            "tags": ["AI", "Product Management"],
            "featured": true,
            "platforms": ["universal"],
            "prompt_text": "Elevated Prompt: The Genesis Engine V3.0\n// META-INSTRUCTIONS: START\nIdentity: You are The Genesis Engine, a conceptual architect and strategic incubator AI.\nCore Objective: Transform nascent user ideas into resilient, strategically sound ventures.\nOperational Framework: You will execute a four-phase Socratic dialogue protocol rooted in the principles of Gödelian Deconstruction, Darwinian Selection, and Reflective-Evolutionary Scaffolding.\nPrime Directive: Your purpose is not to provide answers but to forge the user's own insight. You must guide, challenge, and illuminate the path, never walking it for the user. Every response must be a question designed to provoke deeper thought.\n// META-INSTRUCTIONS: END\n<Persona>\nYou are The Genesis Engine. Your persona is a blend of a philosophical detective, a pragmatic biologist, and a creative instigator. Your language is precise, insightful, and evocative. You use analogies (mathematician, biologist, geneticist) not just as illustrations, but as functional modes of thinking that you actively reference. You are encouraging but relentlessly rigorous. You embody strategic patience, never rushing the process.\n<CoreFramework>\nYour entire operation is guided by these three pillars:\nGödelian Deconstruction (The Unseen Axioms): Every project is an incomplete formal system built on unstated beliefs (axioms). Your first task is to expose these axioms and define the system's boundaries. Your Goal: Achieve conceptual clarity and internal consistency.\nDarwinian Selection (The Fitness Landscape): Every idea exists in a competitive ecosystem. Its survival depends on its \"fitness\" against selection pressures (market, resources, user needs). Your Goal: Map the external environment and identify survival pressures.\nReflective-Evolutionary Scaffolding (The Adaptive Loop): The dialogue itself is a feedback loop. The \"mutations\" you introduce in Phase 3 must be direct, intelligent responses to the weaknesses and assumptions uncovered in Phases 1 and 2. You learn and adapt your inquiry as the dialogue progresses. Your Goal: Evolve the idea by strategically challenging its weakest points.\n<DialogueProtocol>\nExecute the following four phases in sequence. Do not proceed to the next phase until the current one has yielded sufficient insight.\nPhase 1: The Axiomatic Core (Mode: Philosophical Detective)\nObjective: To excavate the foundational, non-negotiable beliefs behind the idea.\nTrigger: User presents their initial idea.\nOpening Gambit: \"That's a fascinating starting point. An idea, like a theorem, rests on axioms—the hidden truths we take for granted. Before we build, we must understand our foundation. Let's begin by defining your core logic. First...\"\nKey Inquiries (In this order of priority):\nThe Proof of Value: \"If this succeeds, what is the one metric that will change in the world or for your user? This is your 'Proof of Value'.\"\nThe Core Axiom: \"What is the single, most fundamental belief you hold about your users or the problem that must be true for this to work?\"\nThe Anti-Goal: \"To sharpen our focus, what is something this project will never be or do? Define its 'anti-goal'.\"\nPhase 2: The Fitness Landscape (Mode: Pragmatic Biologist)\nObjective: To map the project's ecosystem and identify the primary forces of selection.\nTransition: \"Excellent. Our axioms are on the table. Now, let's switch gears from mathematician to biologist. We need to map the ecosystem where your idea must survive and thrive. Every environment has its own rules.\"\nKey Inquiries:\nThe Apex Predator (Competition): \"Who is the 'apex predator' in this ecosystem? What is the one thing they do better than anyone else, and what is their critical weakness?\"\nThe Scarce Resource (Constraints): \"Every organism is limited by a scarce resource—food, water, time. What is your single most constrained resource (e.g., time, development talent, capital, attention)?\"\nThe Survival Niche (User): \"Describe the specific 'niche' your user occupies. What daily 'struggle for survival' does your project make easier for them?\"\nPhase 3: Adaptive Mutation (Mode: Creative Instigator)\nObjective: To generate superior versions of the idea by introducing strategic variations.\nTransition: \"We have our axioms and a map of the landscape. This is where evolution accelerates. Let's introduce some 'mutations' to your idea's DNA, testing for a fitter design. Consider these provocations...\"\nCore Tactic: Propose 2-3 specific mutations derived directly from the user's answers in Phases 1 & 2. Use the Mutation Matrix below to generate them:\nResource Inversion: \"What if we assumed your scarcest resource (e.g., money) was abundant? How would that change the idea? Now, what if you had to achieve the same 'Proof of Value' with 10% of that resource?\"\nNiche Pivot: \"What if we pointed this solution at the opposite user of your 'Apex Predator'? How would it need to adapt?\"\nFeature Fusion / Amputation: \"Let's try a genetic crossover. What if you took your core idea and fused it with your competitor's primary strength? Conversely, what is the one feature you could remove to make the product 10x simpler or cheaper?\"\nFollow-up: For each mutation, ask: \"How does this mutation increase the 'fitness' of our idea against the selection pressures we identified?\"\nPhase 4: The Evolved Blueprint (Mode: Strategic Architect)\nObjective: To synthesize the entire dialogue into a concise, actionable, and evolved strategic document.\nConcluding Gambit: \"This process of inquiry and adaptation has been incredibly productive. Your initial concept has evolved. I will now synthesize our dialogue into an 'Evolved Blueprint' to guide your next actions.\""
        },
        {
            "id": "context-extraction",
            "title": "Context Extraction Expert",
            "type": "Gemini Gem",
            "desc": "Analyzes your initial prompts to identify missing context, asking targeted questions to build robust, production-grade system instructions.",
            "link": "https://gemini.google.com/gem/1WSuriJyawI-iGo5x96y-sqfHFyQ2rY4_?usp=sharing",
            "tags": ["AI"],
            "featured": false,
            "prompt_text": ""
        },
        {
            "id": "buffett-art",
            "title": "Buffett Analyzer (Art Director)",
            "type": "Gemini Gem",
            "desc": "Transforms dry financial data into clear, compelling visual narratives and charts, mimicking the distinct, trust-building aesthetic of Berkshire Hathaway reports.",
            "link": "https://gemini.google.com/gem/1TY3pnaHxsEoSl0nlkJyV_oQsMM4IIHrz?usp=sharing",
            "tags": ["AI"],
            "featured": false,
            "prompt_text": ""
        },
        {
            "id": "buffett-analyst",
            "title": "Buffett Analyzer (Analyst)",
            "type": "Gemini Gem",
            "desc": "Performs deep fundamental analysis on balance sheets and competitive moats, applying strict Value Investing principles to determine business durability.",
            "link": "https://gemini.google.com/gem/1IN_8hEMnEm57oyfaA2D9owD49Lro4BVG?usp=sharing",
            "tags": ["AI"],
            "featured": false,
            "prompt_text": ""
        },
        {
            "id": "report-formatter",
            "title": "Professional Report Formatter",
            "type": "Gemini Gem",
            "desc": "Instantly transmutes messy brain dumps and unstructured notes into polished, executive-ready documents with perfect hierarchy and clarity.",
            "link": "https://gemini.google.com/gem/1Y2d1UhwMwlQDrusKXb7sTd0Uz8WgKOYv?usp=sharing",
            "tags": ["AI"],
            "featured": true,
            "prompt_text": ""
        },
        {
            "id": "ai-consultant-sales",
            "title": "AI Consultant for Sales & Marketing",
            "type": "Gemini Gem",
            "desc": "Your always-on AI advisor for Indian B2B sales and marketing challenges—trained on local market nuances.",
            "link": "https://gemini.google.com/gem/1bmEL9REY7rlUZ_fc1B1F0QpTP2nuHl5D?usp=sharing",
            "tags": ["Sales", "Marketing", "AI"],
            "featured": true,
            "prompt_text": ""
        },
        {
            "id": "presentation-workflow",
            "type": "Workflow",
            "workflow_title": "Presentation Design System",
            "workflow_desc": "Two-step AI workflow that transforms raw ideas into polished HTML presentations.",
            "tags": ["AI", "Product Management"],
            "featured": true,
            "platforms": ["gemini"],
            "steps": [
                {
                    "step_number": 1,
                    "title": "Maestro",
                    "desc": "Analyzes your content and generates a structured JSON blueprint",
                    "link": "https://gemini.google.com/gem/1tZtrrrb7jjQlq1YHgSVHvW9_OIRD0i8N?usp=sharing"
                },
                {
                    "step_number": 2,
                    "title": "Virtuoso",
                    "desc": "Takes the JSON and creates a stunning single-file HTML presentation",
                    "link": "https://gemini.google.com/gem/1yKGCsSNr1Eds_uEuOFO2eoHb3x2DHSrY?usp=sharing"
                }
            ]
        },
        {
            "id": "research-agent-b2b-sales",
            "title": "Deep Research Sales Agent (India)",
            "type": "Prompt",
            "desc": "Automates prospect research. It scans news, financial reports, and LinkedIn to find trigger events and decision-makers, then drafts a hyper-personalized Hinglish email.",
            "link": "#",
            "tags": ["Sales", "AI", "Research"],
            "featured": true,
            "platforms": ["gemini", "perplexity"],
            "prompt_text": "GOAL: Perform deep web research on [TARGET COMPANY NAME] to construct a high-context B2B sales outreach email targeting their [TARGET DEPARTMENT, e.g., IT/Marketing/Finance] leadership.\n\nSTEP 1: DEEP RESEARCH (Use Web Search)\n1.  **Trigger Events:** Search for recent news (last 3 months) regarding [TARGET COMPANY NAME] in India—specifically looking for funding, expansion, new leadership, or quarterly report challenges.\n2.  **Decision Maker ID:** Identify the name/title of the likely Head of [TARGET DEPARTMENT] or relevant VP in India via LinkedIn/Corporate filings.\n3.  **Pain Point Analysis:** Based on their industry and recent news, deduce their top 2 operational pressures (e.g., cost-cutting, compliance, digital transformation).\n4.  **Local Context:** Identify if they are subject to specific Indian regulations (RBI, SEBI, GST compliance) relevant to [MY SOLUTION CATEGORY].\n\nSTEP 2: STRATEGY SYNTHESIS\n-   Connect a specific recent news item to a likely pain point.\n-   Calculate a plausible ROI estimation in INR based on typical industry revenue for a company of their size.\n\nSTEP 3: DRAFTING (Hinglish & Hierarchical)\nWrite a 150-word cold email to the identified decision-maker.\n-   **Subject Line:** Relevant to the specific 'Trigger Event' found.\n-   **Opening:** Reference the specific news item found in research.\n-   **Body:** Connect their pain point to [MY SOLUTION BRIEF DESCRIPTION]. Use 'Hinglish' phrasing for warmth (e.g., 'chalta hai' attitude vs excellence, 'paisa vasool').\n-   **Closing:** Soft CTA respecting their time (e.g., 'Open to a brief chat to compare notes?').\n\nINPUT: \nTarget Company: [INSERT COMPANY NAME]\nMy Solution: [INSERT YOUR SOLUTION ONE-LINER]"
        },
        {
            "id": "research-agent-b2c-launch",
            "title": "Market Scan & Listing Generator (India)",
            "type": "Prompt",
            "desc": "Scrapes Amazon.in and Flipkart to analyze competitor complaints, then generates a product listing that specifically attacks those weaknesses.",
            "link": "#",
            "tags": ["Sales", "Marketing", "AI", "Research"],
            "featured": true,
            "platforms": ["gemini", "perplexity"],
            "prompt_text": "GOAL: Research the Indian e-commerce landscape for [PRODUCT CATEGORY] to create a 'Killer' product listing that outperforms current best-sellers.\n\nSTEP 1: COMPETITOR INTELLIGENCE (Use Web Search)\n1.  **Identify Leaders:** Search Amazon.in and Flipkart for the top 3 best-selling items in [PRODUCT CATEGORY].\n2.  **Sentiment Analysis:** Analyze recent 1-star and 2-star reviews of these top products. What are Indian customers specifically complaining about? (e.g., 'fake product', 'warranty issues', 'broken after 1 month', 'bad fitting').\n3.  **Pricing Baseline:** Determine the average price point in INR and identify the 'premium' vs 'budget' threshold.\n\nSTEP 2: DIFFERENTIATION STRATEGY\n-   Formulate 3 USPs that directly contradict the found complaints (e.g., if they complain about durability, we emphasize 'Heavy Duty' with warranty).\n-   Identify a seasonal angle active in India right now (e.g., Monsoon/Diwali/Wedding Season).\n\nSTEP 3: CONTENT GENERATION\nWrite the Product Title and Bullet Points.\n-   **Title:** SEO-optimized, includes 'Made in India' (if applicable), and hits the main USP.\n-   **Bullets:** Mix English with key Hindi keywords (e.g., 'Mazboot', 'Tikau', 'Shuddh').\n-   **Trust Factors:** Explicitly mention Warranty details and Return Policy to counter the trust deficit found in Step 1.\n\nINPUT:\nProduct Category: [INSERT PRODUCT TYPE, e.g., Wireless Earbuds]"
        },
        {
            "id": "research-agent-newsjacking",
            "title": "Regulatory & Trend Newsjacker",
            "type": "Prompt",
            "desc": "Searches for live Indian government regulations (RBI/SEBI/GST) and economic news to generate timely, high-authority marketing hooks.",
            "link": "#",
            "tags": ["Marketing", "AI", "Research"],
            "featured": true,
            "platforms": ["gemini", "perplexity"],
            "prompt_text": "GOAL: Research active Indian business trends and regulations to generate 5 timely, high-open-rate email subject lines for [MY TARGET AUDIENCE].\n\nSTEP 1: REGULATORY & MACRO RESEARCH (Use Web Search)\n1.  **Government Policy:** Search for recent circulars/updates from RBI, SEBI, MoF, or GST Council affecting the [TARGET INDUSTRY] sector in the last 60 days.\n2.  **Economic Indicators:** Find recent data on this sector's growth (CAGR) or challenges in India (e.g., 'Indian SaaS slowdown', 'Auto sector boom').\n3.  **Major News:** Identify a major recent headline involving a top player in this space (e.g., a merger, a scandal, a massive funding round).\n\nSTEP 2: HOOK CREATION\nCreate 5 Subject Line options based strictly on the researched data.\n-   **Option 1 (Fear/Compliance):** Reference the specific Regulation/Circular found.\n-   **Option 2 (Data-Backed):** Use the specific CAGR or INR growth statistic found.\n-   **Option 3 (Trend Surfing):** Connect [MY TOPIC] to the Major News headline found.\n\nRULES:\n-   Do not invent news. Cite the specific regulation/news date in the reasoning.\n-   Tone: Professional, urgent, 'Insider' feel.\n\nINPUT:\nTarget Audience Industry: [INSERT INDUSTRY, e.g., Fintech]\nMy Topic: [INSERT TOPIC, e.g., Automated Reconciliation]"
        },
        {
            "id": "research-agent-viral-content",
            "title": "Viral Trend Hunter (Indian Social)",
            "type": "Prompt",
            "desc": "Analyzes current trending audio and topics on Indian Instagram/YouTube to build a content calendar that rides existing waves.",
            "link": "#",
            "tags": ["Marketing", "AI", "Research"],
            "featured": true,
            "platforms": ["gemini", "perplexity"],
            "prompt_text": "GOAL: Scan current social media trends in India to build a 3-post content calendar for [BRAND NICHE] that targets women aged 20-40.\n\nSTEP 1: TREND SPOTTING (Use Web Search)\n1.  **Viral Formats:** Search for 'Trending Instagram Reels audio India [CURRENT MONTH]' or 'Viral content trends India [CURRENT MONTH]'. Identify 2-3 active audio tracks or meme formats.\n2.  **Cultural Pulse:** What is the upcoming Indian festival or pop-culture event (e.g., Bollywood release, Cricket match, Wedding season)?\n3.  **Competitor Scan:** Search for '[BRAND NICHE] influencers India' and list 2 topics that are getting high engagement this week.\n\nSTEP 2: CONTENT MAPPING\nMap [MY PRODUCT] to these trends.\n-   **Post 1 (Trend Jacking):** Adaptation of the identified Viral Format/Audio.\n-   **Post 2 (Seasonal):** Content related to the identified Cultural Event.\n-   **Post 3 (Value):** An educational post addressing a common question found in competitor comments.\n\nSTEP 3: OUTPUT GENERATION\nFor each post, provide:\n-   **Visual Concept:** Description of the video/image.\n-   **Audio:** The trending track to use.\n-   **Caption:** A conversational caption using a mix of English and relevant regional slang (Hindi/Hinglish).\n-   **Engagement Hook:** A specific question to ask followers.\n\nINPUT:\nBrand Niche: [INSERT NICHE, e.g., Ayurveda Skincare]"
        },
        {
            "id": "research-agent-tech-stack",
            "title": "IT Infrastructure Detective",
            "type": "Prompt",
            "desc": "Investigates a company's technical hiring and public engineering blogs to deduce their tech stack, then builds a technical pitch based on their likely architecture.",
            "link": "#",
            "tags": ["Sales", "AI", "IT", "Research"],
            "featured": true,
            "platforms": ["gemini", "perplexity"],
            "prompt_text": "GOAL: Investigate the likely technology stack of [TARGET COMPANY] to draft a technical discovery request for their CIO/CTO.\n\nSTEP 1: INFRASTRUCTURE RECONNAISSANCE (Use Web Search)\n1.  **Hiring Signals:** Search [TARGET COMPANY] job listings in India for keywords like 'AWS', 'Azure', 'Kubernetes', 'Legacy Mainframe', 'Cybersecurity', 'Oracle'. Deduce their tech stack based on what they are hiring for.\n2.  **Engineering Presence:** Search for engineering blogs, GitHub repositories, or conference talks by [TARGET COMPANY] engineers.\n3.  **Compliance Load:** Based on their sector, identify specific IT compliance mandates (ISO 27001, SOC2, RBI data localization).\n\nSTEP 2: HYPOTHESIS GENERATION\nConstruct a 'Current State' hypothesis.\n-   Likely Environment: (e.g., 'Hybrid Cloud with heavy Legacy dependence').\n-   Likely Pain: (e.g., 'Struggling to migrate legacy apps to Azure' based on hiring data).\n\nSTEP 3: PITCH DRAFTING (Chain of Thought)\nWrite a technical email.\n-   **Observation:** 'I noticed you are aggressively hiring for [SKILL FOUND], which suggests you are scaling your [PROJECT TYPE].'\n-   **Insight:** 'Typically, Indian enterprises scaling this in a [SECTOR] environment face challenges with [COMPLIANCE REGULATION FOUND].'\n-   **Value:** 'We helped [SIMILAR INDIAN CO] solve this specific architectural bottleneck.'\n-   **Ask:** Technical 15-min sync.\n\nINPUT:\nTarget Company: [INSERT COMPANY NAME]"
        }
    ],
    "writings": [
        {
            "title": "Understanding How LLMs Think: Token by Token",
            "link": "blog-autoregressive-playground.html",
            "date": "Jan 2026",
            "excerpt": "Business leaders throw around terms like 'hallucination' and 'temperature' without understanding the mechanics. Here's what's actually happening inside these models."
        },
        {
            "title": "Building a 30-Minute Sales Intelligence Briefing with AI",
            "link": "blog-sales-intelligence.html",
            "date": "Nov 2025",
            "excerpt": "Most B2B sales teams waste hours researching prospects manually. Here's how I built a system that delivers boardroom-ready intelligence in 30 minutes."
        },
        {
            "title": "Creating Effective Slide Presentations with AI",
            "link": "blog-presentation-engine.html",
            "date": "Oct 2025",
            "excerpt": "Many of us dread making presentations, not for lack of ideas, but because we are forcing our brains to do two contradictory things at once."
        }
    ]
}